[BalanceDefs.BD_TargetDummy_Thresher InteractiveObjectBalanceDefinition]
DefaultDisplayName="Clean in water."

[InteractiveObjects.IO_FishingPole InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[InteractiveObjects.IO_ThresherBait InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[InteractiveObjects.IO_ThresherTrophy InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_ThresherBait UsableItemDefinition]
UseFailureCharacterMessage="Yes you are %s Use this article."
ItemName="Ruins theme."
PickupMessage="It becomes you %s"
UseFailureLevelMessage="You must be level %d to use this item.."
UseFailureConstraintsMessage="You cannot use this item.."
NoManufacturerName="Generally"

[ItemDefs.ID_ThresherBait1 UsableItemDefinition]
UseFailureCharacterMessage="Be yourself %s Use this thing."
ItemName="Build a way"
PickupMessage="are you there %s"
UseFailureLevelMessage="You must be at least %d level to use this feature."
UseFailureConstraintsMessage="This article is prohibited."
NoManufacturerName="life"

[ItemDefs.ID_ThresherBait1:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="This appears to be a rare spam byte.."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_ThresherBait2 UsableItemDefinition]
UseFailureCharacterMessage="You have to do it %s Using this article."
ItemName="Snake"
PickupMessage="it ended. %s"
UseFailureLevelMessage="You must be at least %d level to use this.."
UseFailureConstraintsMessage="You cannot use it."
NoManufacturerName="General"

[ItemDefs.ID_ThresherBait2:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Wow, this hat is amazing."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_ThresherBait3 UsableItemDefinition]
UseFailureCharacterMessage="should %s Use this tool."
ItemName="Crush the stone"
PickupMessage="They will buy %s"
UseFailureLevelMessage="You must be at least %d to use this feature."
UseFailureConstraintsMessage="This number is not available.."
NoManufacturerName="General"

[ItemDefs.ID_ThresherBait3:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Purple baits are rare. The butcher chooses the best food.."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_ThresherBait4 UsableItemDefinition]
UseFailureCharacterMessage="This must be done %s Use this article."
ItemName="Hookbill"
PickupMessage="That's it %s"
UseFailureLevelMessage="You must be at least %d level to use this feature."
UseFailureConstraintsMessage="This article is not available."
NoManufacturerName="as always"

[ItemDefs.ID_ThresherBait4:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Few have seen the brilliance of this legendary orange lure.."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_ThresherBait:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="I wonder why? I need a hug...."
NoConstraintText=""
Suffix=""
Prefix=""

